; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	spectrograph0 - mode
	image1 - mode
	infrared2 - mode
	image3 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	Star12 - direction
	GroundStation13 - direction
	GroundStation8 - direction
	Star9 - direction
	Star14 - direction
	GroundStation6 - direction
	Star2 - direction
	Star7 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon17)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star14)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star7)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star14)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation5)
)
(:goal (and
	(pointing satellite1 Planet15)
	(have_image Planet15 image3)
	(have_image Star16 spectrograph0)
	(have_image Phenomenon17 spectrograph0)
	(have_image Star18 image1)
))

)

; plan
1. (turn_to satellite2 groundstation6 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 groundstation6)
   goals met: 0 of 5
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (calibrate satellite2 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 0 of 5
4. (turn_to satellite2 phenomenon17 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 phenomenon17)
   goals met: 0 of 5
5. (turn_to satellite0 groundstation8 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 groundstation8)
   goals met: 0 of 5
6. (take_image satellite2 phenomenon17 instrument2 spectrograph0)
   added: (have_image phenomenon17 spectrograph0)
   goals met: 1 of 5
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
8. (calibrate satellite0 instrument0 groundstation8)
   added: (calibrated instrument0)
   goals met: 1 of 5
9. (turn_to satellite0 planet15 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 planet15)
   goals met: 1 of 5
10. (take_image satellite0 planet15 instrument0 image3)
   added: (have_image planet15 image3)
   goals met: 2 of 5
11. (turn_to satellite0 star18 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star18)
   goals met: 2 of 5
12. (take_image satellite0 star18 instrument0 image1)
   added: (have_image star18 image1)
   goals met: 3 of 5
13. (turn_to satellite1 planet15 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 planet15)
   goals met: 4 of 5
14. (turn_to satellite2 star16 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 star16)
   goals met: 4 of 5
15. (take_image satellite2 star16 instrument2 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 5 of 5
